Revit 2017 API
FormattedText Constructor (String)
 Creates a new FormattedText object with unformatted text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public FormattedText(
	string plainText
)
Visual Basic
Public Sub New ( _
	plainText As String _
)
Visual C++
public:
FormattedText(
	String^ plainText
)
Parameters
plainText
Type: System.String
 The text in a plain text form.
Remarks
 The given text should have no more than 30,000 characters. Line feed characters ('/n') are not allowed. An empty string is allowed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters. -or- plainText contains invalid characters such as a newline character.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
FormattedText Class
FormattedText Overload
Autodesk.Revit.DB Namespace